content/teaching.md
+++
title = "Teaching"
draft = false
weight = -50
author = false
toc = false
[menu.main]
  weight = 3003
  identifier = "teaching"
+++

I regularly teach the The Philosophy of Food ([PHIL 105](http://phil105.colinmclear.net)), Introduction to
Philosophy ([PHIL 101](/materials/course-syllabi/phil101-syllabus.pdf)), an undergraduate survey of &rsquo;modern&rsquo; philosophy of the
seventeenth and eighteenth centuries ([PHIL 232](/materials/course-syllabi/phil232-syllabus.pdf)), and graduate level courses on
Kant and related topics ([PHIL 460​/860](/materials/course-syllabi/kant-modern-syllabus.pdf), [PHIL 471​/871](http://phil871.colinmclear.net), and PHIL 971).


## Previously Taught {#previously-taught}

-   PHIL 232 (Yearly): History of Early Modern Philosophy
-   PHIL 101 (Yearly): Introduction to Philosophy
-   PHIL 105 (Yearly): [The Philosophy of Food](http://phil105.colinmclear.net)
-   PHIL 971 (Fall 2017): [Self-Knowledge in Kant & Early German Idealism](/materials/course-syllabi/SK-german-idealism-syllabus.pdf)
-   PHIL 971 (Spring 2016): [Introspection & Self-Knowledge](/materials/course-syllabi/ISKSyllabus.pdf)
-   PHIL 971 (Fall 2013): [Seminar on Conceptualism](/materials/course-syllabi/ConceptualismSyllabus.pdf)
-   PHIL 460​/860 (Fall 2016): [Kant & Early Modern Philosophy](/materials/course-syllabi/kant-modern-syllabus.pdf)
-   Oxford Grad Seminar (Trinity 2017) on [Kant on perception and cognition](/materials/course-syllabi/ox-kant-syllabus.pdf), with [Anil Gomes](http://www.anilgomes.com)
